phase3_starter323/app/controllers/employees_controller.rb

SELECT "employees".* FROM "employees"
SELECT  "employees".* FROM "employees" WHERE "employees"."active" = ? ORDER BY last_name, first_name LIMIT ? OFFSET ?  [["active", 1], ["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "employees" WHERE "employees"."active" = ?  [["active", 1]]
---
  def index
    @employees = Employee.all
    @active_employees = Employee.active.alphabetical.paginate(page: params[:page]).per_page(10)

INSERT INTO "employees" ("first_name", "last_name", "ssn", "date_of_birth", "phone", "role", "active", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @employee = Employee.new(employee_params)

    respond_to do |format|
      if @employee.save

UPDATE "employees" SET "date_of_birth" = ?, "updated_at" = ? WHERE "employees"."id" = ?  [["date_of_birth", "1998-07-09"], ["updated_at", "2019-04-01 17:41:42.269500"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @employee.update(employee_params)