phase3_starter323/app/controllers/shifts_controller.rb

  def index
    @shifts = Shift.all
---
SELECT "shifts".* FROM "shifts"