phase3_starter323/app/controllers/stores_controller.rb

SELECT  "stores".* FROM "stores" WHERE "stores"."active" = ? ORDER BY name LIMIT ? OFFSET ?  [["active", 1], ["LIMIT", 10], ["OFFSET", 0]]
---
  def index
    # @stores = Store.alphabetical
    @active_stores = Store.active.alphabetical.paginate(page: params[:page]).per_page(10)

INSERT INTO "stores" ("name", "street", "city", "state", "zip", "phone", "latitude", "longitude", "active", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @store = Store.new(store_params)

    respond_to do |format|
      if @store.save

UPDATE "stores" SET "longitude" = ?, "updated_at" = ? WHERE "stores"."id" = ?  [["longitude", 3.7888], ["updated_at", "2019-04-02 11:01:00.740082"], ["id", 4]]
---
  def update
    respond_to do |format|
      if @store.update(store_params)

DELETE FROM "stores" WHERE "stores"."id" = ?  [["id", 3]]
---
  def destroy
    @store.destroy