phase3_starter323/app/controllers/users_controller.rb

INSERT INTO "users" ("employee_id", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["employee_id", 1], ["email", "ndosari@andrew.edu"], ["password_digest", "12345"], ["created_at", "2019-04-21 11:05:16.767082"], ["updated_at", "2019-04-21 11:05:16.767082"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save