phase3_starter323/app/views/home/_user_home.html.erb

SELECT  "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
<div class="container">
<h1> Welcome Back <%=current_user.employee.first_name.capitalize%>!</h1><br><br>